{
  "project": "cantena-geometry-validation",
  "branchName": "ralph/geometry-validation",
  "description": "Integration test suite that validates the entire geometry engine against a real architectural drawing (first-floor.pdf). Tests vector extraction, scale detection, wall detection, measurement, text extraction, and generates an accuracy report — all against known ground-truth values from a 32'x16' American Farmhouse floor plan at 1/4\"=1'-0\" scale.",
  "userStories": [
    {
      "id": "US-351",
      "title": "Test fixture: load and introspect the real floor plan PDF",
      "description": "As a developer, I want a reusable test fixture that loads test_pdfs/first-floor.pdf and provides basic introspection so that all subsequent test stories can reference the same PDF with consistent setup.",
      "acceptanceCriteria": [
        "tests/conftest.py or tests/integration/conftest.py defines a pytest fixture first_floor_pdf that opens test_pdfs/first-floor.pdf using PyMuPDF and yields the fitz.Document, closing it after the test completes",
        "A second fixture first_floor_page yields the first (and only) page of the document as fitz.Page",
        "A constants file or fixture provides ground truth values: EXPECTED_SCALE_FACTOR=48.0, EXPECTED_OVERALL_WIDTH_FT=32.0, EXPECTED_OVERALL_DEPTH_FT=16.0, EXPECTED_GROSS_AREA_SF=512.0, EXPECTED_TOTAL_WITH_PORCHES_SF (approximate), EXPECTED_ROOM_COUNT>=7",
        "Smoke test in tests/integration/test_first_floor_smoke.py verifies: PDF loads without error, has exactly 1 page, page has non-zero dimensions, page contains text (not a scanned image)",
        "Test file path is resolved robustly using Path(__file__).resolve().parents[2] / 'test_pdfs' / 'first-floor.pdf' pattern",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Ground truth: main building footprint 32'x16'=512 SF (porches extend beyond). Scale 1/4\"=1'-0\" means scale_factor=48. Room names: Living Room, Kitchen, Dining, Front Porch, Back Porch, Utility, WC, Coats, Laundry. Use ±10-15% tolerance in assertions."
    },
    {
      "id": "US-352",
      "title": "Validate vector extraction on the real floor plan",
      "description": "As a developer, I want to verify that the VectorExtractor correctly pulls meaningful geometry from first-floor.pdf so that I know the PDF contains usable CAD vector data and the extractor handles it properly.",
      "acceptanceCriteria": [
        "tests/integration/test_first_floor_vectors.py uses the first_floor_page fixture",
        "VectorExtractor.extract() returns DrawingData with at least 50 paths",
        "DrawingStats shows line_count > 20, rect_count >= 0",
        "Bounding box of all geometry covers at least 50% of page width and 40% of page height",
        "At least 2 distinct line_width values exist among vector paths; log the distribution of line widths",
        "Most paths have stroke_color defined (not None); black/dark gray should be the majority",
        "filter_by_region works: filtering to left half of drawing area returns fewer paths than unfiltered",
        "If PDF is rasterized (not vector), skip tests with pytest.skip and document finding",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 2,
      "passes": true,
      "notes": "This is the 'does the PDF have what we need' test. Line width distribution is valuable debugging info for wall detection thresholds."
    },
    {
      "id": "US-353",
      "title": "Validate scale detection on the real floor plan (no brittle regex dependency)",
      "description": "As a developer, I want to verify that the ScaleDetector correctly identifies the 1/4\"=1'-0\" scale from this drawing in a way that is resilient to formatting variance, so the geometry engine is not dependent on a single brittle regex.",
      "acceptanceCriteria": [
        "tests/integration/test_first_floor_scale.py uses the first_floor_page fixture",
        "extract_text_blocks returns at least 20 text blocks from the page; print first 30 for debugging",
        "ScaleDetector.detect_from_text uses a two-step approach: text normalization then tolerant parsing (not a single regex)",
        "detect_from_text correctly finds scale: returns ScaleResult with scale_factor approximately 48.0 (±2)",
        "parse_dimension_string correctly parses all dimension strings: 32'->384in, 16'->192, 6'-6\"->78, 5'-6\"->66, 3'-4\"->40, 2'-8\"->32, 8'->96, 1'-6\"->18, 9'-8\"->116, 3'-1\"->37, 2'-1\"->25",
        "detect_from_dimensions attempts scale inference from dimension lines + text; if successful assert scale_factor within ±15% of 48.0",
        "When detect_from_text fails on deliberately messy formatting, system still produces usable scale via normalization improvements, dimension fallback, or graceful degradation (no hard failure)",
        "Engine behaves correctly if optional ScaleTextInterpreter is not configured (no env var, no key)",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 3,
      "passes": true,
      "notes": "Title block scale strings vary a lot. Avoid single brittle regex by normalizing text and parsing via tokens/grammar. API text-normalization fallback is allowed but optional. Dimension calibration is the best non-text fallback."
    },
    {
      "id": "US-354",
      "title": "Validate wall detection and area computation on the real floor plan",
      "description": "As a developer, I want to verify that the WallDetector correctly identifies the structural walls of this farmhouse and computes an area close to the known 32'x16' = 512 SF footprint so that I have confidence the geometry engine produces accurate measurements on real drawings.",
      "acceptanceCriteria": [
        "tests/integration/test_first_floor_walls.py uses first_floor_page fixture and vector data from US-352",
        "WallDetector.detect() returns WallAnalysis with at least 8 wall segments",
        "At least 3 HORIZONTAL and at least 3 VERTICAL segments detected",
        "Total detected wall length (after scale conversion) is between 80 LF and 250 LF; log segments if outside range",
        "outer_boundary detection produces a polygon whose area is approximately 512 SF (±25%): assert between 380 SF and 700 SF; log computed area",
        "Wall thickness detection (if detected) is between 3 and 12 inches",
        "Diagnostic logging: print summary of N walls, X horizontal (avg Y ft), Z vertical (avg W ft), thickness ~T inches",
        "If wall heuristics need tuning, adjust thresholds in WallDetector and document in progress.txt",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 4,
      "passes": false,
      "notes": "Most important test story. ±25% area tolerance is generous for first pass. If wildly off, wall detection needs tuning (line weight threshold, color filter, polyline handling). Diagnostics required."
    },
    {
      "id": "US-355",
      "title": "Validate full MeasurementService pipeline on the real floor plan",
      "description": "As a developer, I want to run the complete MeasurementService.measure() pipeline on first-floor.pdf and verify it produces a PageMeasurements result with realistic values, while ensuring scale detection is not a single point of failure.",
      "acceptanceCriteria": [
        "tests/integration/test_first_floor_measurement.py uses the first_floor_page fixture",
        "MeasurementService.measure() completes without error and returns a PageMeasurements object",
        "On real drawing, scale is detected: result.scale is not None and scale_factor ~48.0 (±5)",
        "Separate test injects mangled scale text via mocked text extraction and asserts: pipeline still returns a result (no crash), confidence degrades appropriately",
        "gross_area_sf is between 350 and 800 SF (true ~512 SF); log actual value",
        "building_perimeter_lf is between 70 and 200 LF",
        "total_wall_length_lf is between 80 and 300 LF",
        "Confidence is at least MEDIUM on the unmodified real drawing",
        "Diagnostic report test (always passes): print formatted report including % error vs 512 SF",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 5,
      "passes": false,
      "notes": "Enforce that the pipeline does not hinge on a single fragile parsing step. On clean drawings expect HIGH/MEDIUM confidence. On messy text expect graceful degradation, not failure."
    },
    {
      "id": "US-356",
      "title": "Validate text and room label extraction for future room-type detection",
      "description": "As a developer, I want to verify that we can extract room labels and their positions from this drawing so that future room-type-aware costing can map measured areas to named rooms.",
      "acceptanceCriteria": [
        "tests/integration/test_first_floor_rooms.py uses the first_floor_page fixture",
        "Extract all text blocks with positions; assert we find (case-insensitive): LIVING ROOM, KITCHEN, DINING, FRONT PORCH, BACK PORCH, UTILITY, WC, COATS, LAUNDRY; log which found/missed",
        "Room labels' positions fall within drawing content area (not title block/margins)",
        "Room labels are spatially separated: no two label positions within 20 PDF points",
        "Coarse zone mapping: define zones (left half vs right half) and assert labels fall in expected zones",
        "Find text blocks matching dimension patterns; assert at least 10 dimension blocks found",
        "Find text blocks in lower-right area; assert we find: SCALE, 1/4, A1.2, 1ST FLOOR, AMERICAN FARMHOUSE",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 6,
      "passes": false,
      "notes": "Validates text extraction needed for room-type-aware costing. Spatial accuracy matters: labels must land inside the correct room. Drawing includes annotations that are not room labels."
    },
    {
      "id": "US-357",
      "title": "Geometry accuracy report and known-limitations documentation",
      "description": "As a developer, I want a comprehensive accuracy report for the geometry engine on this test drawing and documentation of known limitations so that the team understands exactly where we are and what needs improvement.",
      "acceptanceCriteria": [
        "tests/integration/test_first_floor_report.py runs the full geometry pipeline and generates test_results/first-floor-geometry-report.md (creates test_results/ dir if needed)",
        "Report contains: Drawing Info (filename, page size, scale detected, vector path count)",
        "Report contains: Measurement Results (gross area SF expected vs actual + % error, perimeter LF expected vs actual, wall count, wall length)",
        "Report contains: Text Extraction (room labels found, dimension strings found, title block fields found)",
        "Report contains: Confidence Assessment (overall confidence + per-component confidence)",
        "Report contains: Known Limitations section with severity (critical/moderate/minor) and suggested fix for each issue",
        "Report contains: Recommendations section (what to tune, what VLM vs geometry should handle, what PDF classes work well vs poorly)",
        "Report documents which scale detection path was used: deterministic normalization/parsing, dimension calibration fallback, or optional API text interpreter",
        "Separate assertion test verifies minimum thresholds: scale factor within ±10% of 48.0, gross area within ±30% of 512 SF, at least 6 room labels extracted",
        "Report-generation test always passes (diagnostic tool) but must create the report file",
        "All quality gates pass (pytest, mypy --strict, ruff check)"
      ],
      "priority": 7,
      "passes": false,
      "notes": "Capstone story. The report is the single place to understand accuracy on a real drawing. Minimum thresholds are achievable for a clean, well-dimensioned plan. Over time tighten tolerances (Phase 1 ±15% area, production ±10%)."
    }
  ]
}
